In [7]:
import pandas as pd

In [8]:
data = [1,2,3,4]

In [9]:
series= pd.Series(data)
series

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
data= [[1,2,3,4,65],[2,3,41111,3333],'abc']
df=pd.DataFrame(data)
df

   0  1      2       3     4
0  1  2      3     4.0  65.0
1  2  3  41111  3333.0   NaN
2  a  b      c     NaN   NaN

In [11]:
dictdata={"a":[1,2,4,5566,333],"c":[2323,4545,233323,1,"xx"]}
df2= pd.DataFrame(dictdata)
df2

      a       c
0     1    2323
1     2    4545
2     4  233323
3  5566       1
4   333      xx

In [13]:
d1=pd.DataFrame({"A":[1,2,3],"B":[2,3,4]})
d1

   A  B
0  1  2
1  2  3
2  3  4

In [14]:
d2=pd.DataFrame({"A":[3,4,5],"C":[11,12,23]})
d2

   A   C
0  3  11
1  4  12
2  5  23

In [15]:
pd.concat([d1,d2])

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0   NaN
0  3  NaN  11.0
1  4  NaN  12.0
2  5  NaN  23.0

In [16]:
pd.concat([d1,d2],axis=0,join="inner")

   A
0  1
1  2
2  3
0  3
1  4
2  5

In [17]:
pd.concat([d1,d2],axis=1,join="inner")

   A  B  A   C
0  1  2  3  11
1  2  3  4  12
2  3  4  5  23

In [19]:
pd.merge(d1,d2,on=["A"],how="inner")

   A  B   C
0  3  4  11

In [20]:
pd.merge(d1,d2,on=["A"],how="outer")

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0  11.0
3  4  NaN  12.0
4  5  NaN  23.0

In [21]:
pd.merge(d1,d2,how="right")

   A    B   C
0  3  4.0  11
1  4  NaN  12
2  5  NaN  23

In [22]:
pd.merge(d1,d2,how="left")

   A  B     C
0  1  2   NaN
1  2  3   NaN
2  3  4  11.0

In [23]:
pd.merge(d1,d2,how="outer")

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0  11.0
3  4  NaN  12.0
4  5  NaN  23.0